In [1]:
import numpy as np
import pandas as pd
from tqdm.notebook import tqdm

In [2]:
harangi_df = pd.read_csv('reservoir_cleaned/harangi.csv')
harangi_df.head(3)

,FLOW_DATE,RESERVOIR,PRESENT_STORAGE_TMC,RES_LEVEL_FT,INFLOW_CUSECS,OUTFLOW_CUECS
0,2011-01-01,Harangi,3.74,2835.90,142,0
1,2011-01-02,Harangi,3.76,2836.09,239,0
2,2011-01-03,Harangi,3.77,2836.22,166,0

In [3]:
kabini_df = pd.read_csv('reservoir_cleaned/kabini.csv')
kabini_df.head(3)

,FLOW_DATE,RESERVOIR,PRESENT_STORAGE_TMC,RES_LEVEL_FT,INFLOW_CUSECS,OUTFLOW_CUECS
0,2011-01-01,Kabini,16.04,2278.22,570,50
1,2011-01-02,Kabini,16.08,2278.29,570,50
2,2011-01-03,Kabini,16.12,2278.37,635,50

In [4]:
hemavathi_df = pd.read_csv('reservoir_cleaned/hemavathi.csv')
hemavathi_df.head(3)

,FLOW_DATE,RESERVOIR,PRESENT_STORAGE_TMC,RES_LEVEL_FT,INFLOW_CUSECS,OUTFLOW_CUECS
0,2011-01-01,Hemavathi,31.60,2916.07,981,2001.0
1,2011-01-02,Hemavathi,31.50,2915.95,849,1950.0
2,2011-01-03,Hemavathi,31.39,2915.82,782,1950.0

In [5]:
krs_df = pd.read_csv('reservoir_cleaned/krs.csv')
krs_df.head(3)

,FLOW_DATE,RESERVOIR,PRESENT_STORAGE_TMC,RES_LEVEL_FT,INFLOW_CUSECS,OUTFLOW_CUECS
0,2011-01-01,K.R.S,46.42,122.59,2029,2000
1,2011-01-02,K.R.S,46.54,122.68,3084,1490
2,2011-01-03,K.R.S,46.64,122.75,2776,1491

In [6]:
hemavathi_df.shape, harangi_df.shape, kabini_df.shape, krs_df.shape

((3312, 6), (3319, 6), (3312, 6), (3311, 6))

In [7]:
df = pd.concat([hemavathi_df, harangi_df, kabini_df, krs_df], ignore_index=True)
df

,FLOW_DATE,RESERVOIR,PRESENT_STORAGE_TMC,RES_LEVEL_FT,INFLOW_CUSECS,OUTFLOW_CUECS
0,2011-01-01,Hemavathi,31.60,2916.07,981,2001.0
1,2011-01-02,Hemavathi,31.50,2915.95,849,1950.0
2,2011-01-03,Hemavathi,31.39,2915.82,782,1950.0
3,2011-01-04,Hemavathi,31.34,2915.77,695,1075.0
4,2011-01-05,Hemavathi,31.34,2915.77,661,550.0
...,...,...,...,...,...,...
13249,2020-12-12,K.R.S,43.04,120,3496,3308
13250,2020-12-13,K.R.S,43.02,119.98,3197,3300
13251,2020-12-14,K.R.S,42.98,119.95,3026,3273
13252,2020-12-15,K.R.S,42.92,119.90,2530,3068
13253,2020-12-16,K.R.S,42.83,119.83,2416,3243

In [8]:
df['YEAR'] = df['FLOW_DATE'].str[:4]
df['MONTH'] = df['FLOW_DATE'].str[5:7]
df['DATE'] = df['FLOW_DATE'].str[8:]
df.head()

,FLOW_DATE,RESERVOIR,PRESENT_STORAGE_TMC,RES_LEVEL_FT,INFLOW_CUSECS,OUTFLOW_CUECS,YEAR,MONTH,DATE
0,2011-01-01,Hemavathi,31.60,2916.07,981,2001.0,2011,01,01
1,2011-01-02,Hemavathi,31.50,2915.95,849,1950.0,2011,01,02
2,2011-01-03,Hemavathi,31.39,2915.82,782,1950.0,2011,01,03
3,2011-01-04,Hemavathi,31.34,2915.77,695,1075.0,2011,01,04
4,2011-01-05,Hemavathi,31.34,2915.77,661,550.0,2011,01,05

In [9]:
day_df = df[['MONTH', 'DATE']].drop_duplicates().reset_index(drop=True).reset_index()
day_df.rename(columns={'index': 'DAY'}, inplace=True)
day_df

     DAY MONTH DATE
0      0    01   01
1      1    01   02
2      2    01   03
3      3    01   04
4      4    01   05
..   ...   ...  ...
361  361    12   28
362  362    12   29
363  363    12   30
364  364    12   31
365  365    02   29

[366 rows x 3 columns]

In [10]:
df = df.merge(day_df, on=['MONTH', 'DATE'])
df

,FLOW_DATE,RESERVOIR,PRESENT_STORAGE_TMC,RES_LEVEL_FT,INFLOW_CUSECS,OUTFLOW_CUECS,YEAR,MONTH,DATE,DAY
0,2011-01-01,Hemavathi,31.60,2916.07,981,2001.0,2011,01,01,0
1,2012-01-01,Hemavathi,12.48,2886.90,111,4488.0,2012,01,01,0
2,2014-01-01,Hemavathi,11.64,2884.84,125,3225.0,2014,01,01,0
3,2015-01-01,Hemavathi,24.04,2906.38,104,4325.0,2015,01,01,0
4,2016-01-01,Hemavathi,6.23,2869.10,163,125.0,2016,01,01,0
...,...,...,...,...,...,...,...,...,...,...
13249,2020-02-29,Harangi,3.54,2834,40,40,2020,02,29,365
13250,2016-02-29,Kabini,8.35,2262.62,118,1000,2016,02,29,365
13251,2020-02-29,Kabini,15.48,2277.20,112,1700,2020,02,29,365
13252,2016-02-29,K.R.S,17.98,93.27,370,584,2016,02,29,365
13253,2020-02-29,K.R.S,33.07,111.32,248,3721,2020,02,29,365

In [11]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 13254 entries, 0 to 13253
Data columns (total 10 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   FLOW_DATE            13254 non-null  object
 1   RESERVOIR            13254 non-null  object
 2   PRESENT_STORAGE_TMC  13254 non-null  float64
 3   RES_LEVEL_FT         13254 non-null  object
 4   INFLOW_CUSECS        13254 non-null  object
 5   OUTFLOW_CUECS        13254 non-null  object
 6   YEAR                 13254 non-null  object
 7   MONTH                13254 non-null  object
 8   DATE                 13254 non-null  object
 9   DAY                  13254 non-null  int64
dtypes: float64(1), int64(1), object(8)
memory usage: 1.1+ MB

In [12]:
df[df['INFLOW_CUSECS'] == '&nbsp;']

,FLOW_DATE,RESERVOIR,PRESENT_STORAGE_TMC,RES_LEVEL_FT,INFLOW_CUSECS,OUTFLOW_CUECS,YEAR,MONTH,DATE,DAY
4352,2014-05-15,Hemavathi,0.0,&nbsp;,&nbsp;,0.0,2014,05,15,134
4360,2014-05-15,Harangi,0.0,&nbsp;,&nbsp;,0,2014,05,15,134
4368,2014-05-15,Kabini,0.0,&nbsp;,&nbsp;,0,2014,05,15,134
4376,2014-05-15,K.R.S,0.0,&nbsp;,&nbsp;,0,2014,05,15,134

In [13]:
df[df['OUTFLOW_CUECS'] == ' ']

,FLOW_DATE,RESERVOIR,PRESENT_STORAGE_TMC,RES_LEVEL_FT,INFLOW_CUSECS,OUTFLOW_CUECS,YEAR,MONTH,DATE,DAY
526,2015-01-17,Harangi,0.87,2791.38,96,,2015,01,17,16

In [14]:
for idx in df[df['INFLOW_CUSECS'] == '&nbsp;'].index:
    df.loc[idx, 'INFLOW_CUSECS'] = 0

for idx in df[df['OUTFLOW_CUECS'] == ' '].index:
    df.loc[idx, 'OUTFLOW_CUECS'] = 0

In [15]:
df['INFLOW_CUSECS'] = df['INFLOW_CUSECS'].astype(float)
df['OUTFLOW_CUECS'] = df['OUTFLOW_CUECS'].astype(float)

In [16]:
df.drop_duplicates(inplace=True)
df.shape

(13242, 10)

In [17]:
df.to_csv('reservoir_dataset.csv', index=False)